Catalogs/MRS_КлассыМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>MRS_КлассыМеню</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодКлассаСимфони</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Own</ObjectBelonging>
					<Name>ПриоритетПрименения</Name>
					<Comment>Порядок проверки классов (меньше = выше приоритет)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Own</ObjectBelonging>
							<Name>ВидУсловия</Name>
							<Comment>Путь к полю компоновки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Own</ObjectBelonging>
							<Name>Оператор</Name>
							<Comment>Оператор сравнения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Own</ObjectBelonging>
							<Name>Значение</Name>
							<Comment>Универсальное поле для хранения значения условия</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>d6p1:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>d6p1:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
								<v8:Type>d6p1:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/MRS_КлассыМеню/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Создаем схему компоновки данных с доступными полями
	СоздатьСхемуКомпоновки();
	
	// Загружаем условия из табличной части в компоновщик
	ЗагрузитьУсловияИзТабличнойЧасти();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Выгружаем условия из компоновщика в табличную часть
	ВыгрузитьУсловияВТабличнуюЧасть(ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьСхемуКомпоновки()
	
	СхемаКД = Новый СхемаКомпоновкиДанных;
	
	// Набор данных
	НаборДанных = СхемаКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	
	// Добавляем доступные поля для условий
	
	// СтавкаНДС
	Поле = НаборДанных.Поля.Добавить(Тип("ПолеНаборДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "СтавкаНДС";
	Поле.ТипЗначения = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	Поле.Заголовок = "Ставка НДС";
	
	// МернаяЕдиницаИзмерения
	Поле = НаборДанных.Поля.Добавить(Тип("ПолеНаборДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "МернаяЕдиницаИзмерения";
	Поле.ТипЗначения = Новый ОписаниеТипов("Булево");
	Поле.Заголовок = "Мерная единица измерения";
	
	// СвободнаяЦена
	Поле = НаборДанных.Поля.Добавить(Тип("ПолеНаборДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "СвободнаяЦена";
	Поле.ТипЗначения = Новый ОписаниеТипов("Булево");
	Поле.Заголовок = "Свободная цена";
	
	// ЕдиницаИзмерения
	Поле = НаборДанных.Поля.Добавить(Тип("ПолеНаборДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "ЕдиницаИзмерения";
	Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
	Поле.Заголовок = "Единица измерения";
	
	// Номенклатура
	Поле = НаборДанных.Поля.Добавить(Тип("ПолеНаборДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "Номенклатура";
	Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	Поле.Заголовок = "Номенклатура";
	
	// Инициализируем компоновщик настроек
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУсловияИзТабличнойЧасти()
	
	// Очищаем текущие условия в компоновщике
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	// Загружаем условия из табличной части
	Для Каждого СтрокаУсловия Из Объект.Условия Цикл
		
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрокаУсловия.ВидУсловия);
		ЭлементОтбора.ВидСравнения = ПолучитьВидСравнения(СтрокаУсловия.Оператор);
		ЭлементОтбора.ПравоеЗначение = СтрокаУсловия.Значение;
		ЭлементОтбора.Использование = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьУсловияВТабличнуюЧасть(ТекущийОбъект)
	
	// Очищаем табличную часть
	ТекущийОбъект.Условия.Очистить();
	
	// Выгружаем условия из компоновщика
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") 
			И ЭлементОтбора.Использование Тогда
			
			НоваяСтрока = ТекущийОбъект.Условия.Добавить();
			НоваяСтрока.ВидУсловия = Строка(ЭлементОтбора.ЛевоеЗначение);
			НоваяСтрока.Оператор = ПолучитьОператорИзВидаСравнения(ЭлементОтбора.ВидСравнения);
			НоваяСтрока.Значение = ЭлементОтбора.ПравоеЗначение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидСравнения(Оператор)
	
	Если Оператор = "Равно" Тогда
		Возврат ВидСравненияКомпоновкиДанных.Равно;
	ИначеЕсли Оператор = "НеРавно" Тогда
		Возврат ВидСравненияКомпоновкиДанных.НеРавно;
	ИначеЕсли Оператор = "Больше" Тогда
		Возврат ВидСравненияКомпоновкиДанных.Больше;
	ИначеЕсли Оператор = "БольшеИлиРавно" Тогда
		Возврат ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ИначеЕсли Оператор = "Меньше" Тогда
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
	ИначеЕсли Оператор = "МеньшеИлиРавно" Тогда
		Возврат ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ИначеЕсли Оператор = "Содержит" Тогда
		Возврат ВидСравненияКомпоновкиДанных.Содержит;
	ИначеЕсли Оператор = "НеСодержит" Тогда
		Возврат ВидСравненияКомпоновкиДанных.НеСодержит;
	ИначеЕсли Оператор = "Заполнено" Тогда
		Возврат ВидСравненияКомпоновкиДанных.Заполнено;
	ИначеЕсли Оператор = "НеЗаполнено" Тогда
		Возврат ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Иначе
		Возврат ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьОператорИзВидаСравнения(ВидСравнения)
	
	Если ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		Возврат "Равно";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		Возврат "НеРавно";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
		Возврат "Больше";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		Возврат "БольшеИлиРавно";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
		Возврат "Меньше";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		Возврат "МеньшеИлиРавно";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
		Возврат "Содержит";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
		Возврат "НеСодержит";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
		Возврат "Заполнено";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		Возврат "НеЗаполнено";
	Иначе
		Возврат "Равно";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
